{
  "start_scene": "intro",
  "scenes": {
    "intro": {
      "text": "🏙️ Вы приезжаете в тихий и на первый взгляд обычный город — **Мистик Фоллс**. Но в воздухе есть нечто странное... словно туман времени и магии обволакивает улицы. 🌆 \n\nВы ещё не успели распаковать вещи, как перед вами встаёт выбор, чем же вы займетесь в этом городе:",
      "choices": {
        "📚 Пойти учиться в школу": "school_start",
        "🍔 Пойти работать в Mystic Grill": "grill_start"
      }
    },

    "school_start": {
      "text": "🏫 Школа Мистик Фоллс встречает вас звоном звонков, запахом старых учебников и суматохой коридоров. \n\nВскоре вы замечаете трёх девушек, которые будто бы светятся на фоне остальных: \n\n✨__Елена__ — добрая и спокойная,\n🔮 __Бонни__ — загадочная, от одного её взгляда пробегают мурашки,\n💖 __Кэролайн__ — яркая и энергичная. \n\nКажется, судьба подталкивает вас сделать выбор...",
      "choices": {
        "👋 Подойти познакомиться": "girls_meet",
        "🚶 Обойти стороной": "school_ignore"
      }
    },

    "girls_meet": {
      "text": "Вы решаетесь подойти.✨ Девушки встречают вас удивительно тепло — будто давно ожидали вашего появления. \n\nВечером вы собираетесь у Елены дома отметить ваше знакомство. 🕯️ Дом уютный, но в воздухе чувствуется лёгкое напряжение, словно стены скрывают давние тайны. \n\nЗа чашкой чая ☕ разговор становится серьёзным. Девушки рассказывают о сверхъестественной стороне Мистик Фоллс — о магии, охотниках и вампирах. 🧛‍♂️ \n\nЕлена смотрит вам прямо в глаза: \n\n\"✨ **У тебя есть выбор.**\"",
      "choices": {
        "🧛 Стать вампиром": "turn_vampire",
        "❤️ Остаться человеком и забыть всё": "forget_and_live"
      }
    },

    "school_ignore": {
      "text": "🚶‍♂️ Вы проходите мимо девушек, решив не вмешиваться в их компанию. Школьная жизнь течёт спокойно — уроки, перемены, редкие посиделки. 🌤️ \n\nНикакой мистики, никакой опасности. Всего лишь обычная человеческая жизнь.",
      "choices": {}
    },

    "turn_vampire": {
      "text": "🧛‍♂️ Комната замирает. Девушки переглядываются, признавая серьёзность вашего решения. \n\nЕлена подходит ближе. Её прикосновение холодное, как ночь. 🌑 \n\nМир резко меняется — звуки становятся громче, краски ярче, сила наполняет тело. ⚡\n\nТеперь вы — **вампир**. Ваша новая жизнь в Мистик Фоллс только начинается...",
      "choices": {}
    },

    "forget_and_live": {
      "text": "🌤️ Девушки понимают ваш выбор и Кэролайн мягко касается вашего плеча и смотрит прямо в глаза. Всё вокруг затуманивается, будто сон уносит воспоминания. \n\nВы просыпаетесь дома, чувствуя странную пустоту, но не понимая почему. \n\nВы остались **человеком**. И проживёте долгую, спокойную жизнь… пусть и с ощущением, что вы забыли что-то важное. 🌙",
      "choices": {}
    },

    "grill_start": {
      "text": "🍔 **Mystic Grill** встречает запахом еды, смехом, стуком посуды и тёплой атмосферой. \n\nЗдесь вы знакомитесь с Мэттом Донован  и Джереми Гилберт — простыми, но дружелюбными ребятами. \n\nОни приглашают вас на вечеринку у Кэролайн. 🎉",
      "choices": {
        "🎉 Согласиться пойти": "party_scene",
        "❌ Отказаться": "grill_decline"
      }
    },

    "party_scene": {
      "text": "🎉 Вы приходите на вечеринку. Дом Кэролайн сияет огнями, играет музыка, пары танцуют, люди смеются. Всё выглядит красиво, почти сказочно. ✨ \n\nВы стоите у барной стойки, когда к вам подходит {vamp_name}. {vamp_gender} взгляд приковывает ваше внимание - глубокий, чуть опасный, но манящий 🖤 \n\n{vamp_name} улыбается: \n-Привет!Я вижу, ты новичок в Мистик Фоллс. Не против потанцевать со мной? \n\nВы чувствуете легкое волнение и предвкушение... ",
      "choices": {
        "💃 Потанцевать": "party_dance",
        "🙅 Отказаться": "party_refuse"
      }
    },

    "party_dance": {
      "text": "Вы соглашаетесь на танец. 💃🕺 {vamp_name} берет вас за руку, и музыка окутывает все вокруг, слово мир перестает существовть за пределами танцпола. \n\nВы чувствуете как пульс ускоряется, а дыхание становиться прерывистым. {vamp_name} шепчет: 'Давай уйдем подальше от лишних глаз...' \n\n Вы находитесь в тихой комнате, где свет мягко играет на стенах, а музыка слышна лишь отдаленным эхом 🌑 \n\nВнезапно вы ощущаете странное тепло, пронизывающее все тело, а потом - холодное касание к шее. Это мгновение меняет вас навсегда ✨ \n\nВы стали вампиром. 🧛‍♂️",
      "choices": {}
    },

    "party_refuse": {
      "text": "🙅 Вы отказываетесь. {vamp_name} улыбается, но в его взгляде мелькает опасность. 🩸 \n\nВозвращаясь домой в ночной тишине, вы слышите быстрые шаги позади… \n\nЭто последний звук вашей жизни...",
      "choices": {}
    },

    "grill_decline": {
      "text": "Вы решаете остаться дома. 🏠 \n\nВечер проходит спокойно и тихо, и вы живёте обычной человеческой жизнью — без мистики, без опасностей, но и без великих приключений. 🍀",
      "choices": {}
    }
  }
}